IDEA Open Model
CrossSectionComponentEdges Class
Compatible with IDEA StatiCa Beta 20.0
 Cross-section component edges
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Loading.CrossSectionComponentEdges
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class CrossSectionComponentEdges : OpenObject
Public Class CrossSectionComponentEdges
	Inherits OpenObject
The CrossSectionComponentEdges type exposes the following members.
Constructors
Name | Description
CrossSectionComponentEdges
 Constructor
Top
Properties
Name | Description
ComponentIndex
 Zero based index of component
EdgeIndexes
 List of zero based edge indexes of component
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace